#  陈天爽   王涵宇  李瑾元  苏权
#罗晓 孟泽宇 夏睿宸周二补课



#赋值运算符
#a   =  3   #读作:    "把10赋值给变量a"
#a  =  a+10   # 简写为:    a   +=10
#a   +=   10   #+和=之间不能有空格
#  a   /=10    #  a=  a/10  
#a  *=  10   #  a=  a*10
#a  %=  3   #    %表示取余数
#a//=3
#a  **=  4   #     5**4  ->  5*5*5*5
# ~ print(a)


#小括号中可以随便换行
#Python一行代码代表一个语句
#一般情况下一个语句只能写在一行上
#如果没有特殊处理不能将多个语句写在同一行
# ~ a=10   +  \  #这里的\符号是续行符,表示本行与下一行代码为同一行
# ~ 100+1
#续行符(\)后面什么都不能有(特别是不能有空格)

# ~ a=   a+5
# ~ print(a)
# ~ print(a
# ~ +
# ~ 10
# ~ )




# ~ a=b=c=10
# ~ x= a+b+   \
# ~ c+ \
# ~ 12
# ~ print(x)








a=10
b=a+3.5
print(a)
print(type(a))
print(b)
print(type(b))




