//  复习位运算


#include<bits/stdc++.h>
using  namespace  std;
int main(){
	
	
//	int   a=0x10;  //16进制数
//	int   b=010;  //8进制数
//	int  c=0b10;    //二进制数
//	cout<<c;
	
	
	
//	cout<<  (5<<1);
//按位左移一位就是乘2
//	cout<<   (-5<<1);//  10-> 20->40
	//按位右移一位就是除2
	//cout<< (-5>>1);
//	int  n;
//	cin>>n;
//	cout<<(n&(-n));



//	  int   a=2;
//	  
//	 // a|=1;   //a= a|1;
//	 //a&=1;
//	 
//	 a^=1;
//	  
//	  cout<<a;
//	  



	int   n, x   ,ans=0;
	cin>>n;
	for (int i=0;i<n;i++){
		cin>>x;
		ans^=x; 
	}
	
	
	cout<<ans;

//  任何数和0按位异或的结果都是它本身
//	int   n,ans=0;
//	cin>>n;
//	cout<<  (ans^n);
	
	
	
	return  0;
}










//给你一个正整数A,输出A的最低数
//A=26,  11010  ->  2
//A=88,  1011000 ->  8 


//输入样例:
//26
//输出样例:
//2


//  打翻了筷子, 要一对一对地配回去,  长度一样的筷子才是一对
//不过有一根筷子是落单的,找出落单的筷子


//输入样例:
//5
//1 2 1 2 3
//输出样例:
//3






