# 夏睿宸请假  罗晓没来  
#上述二人周二补课了



# ~ a = 19+1  #等号读作:  赋值,  这个语句称为赋值语句
#赋值语句是从右向左执行

# ~ a=b=c=110

# ~ a,b,c=1,5,6


#desk  =  30  #  赋值语句是有方向的,
#变量只能放在左边,  值只能放在右边
#跟数学中的等号完全不一样













#weight = 10.5

#name='古三通'

#Lily=Lucy=David=Daniu=99

#Lily ,Lucy, David,Daniu=97,98,96,100

# ~ a=  2+4*6*6
# ~ print(a)

#数据类型
#数据类型就是给数据的分类
#数据大致分为:  数字  文本(text)

#但是Python中的数据分类更细致:
#整数   浮点数(小数)    字符串(文本)   布尔类型

#详解:
#整数  int   

# ~ a=10
# ~ print( a)#   print是输出
# ~ #type(a)  查看变量a的数据类型
# ~ print(type(a))



#浮点数(小数)   float

# ~ a=19.5
# ~ print(a)
# ~ print(type(a))



#字符串  str
#字符串就是文本,  除了数字和布尔类型之外的
#其他数据都可以声明为字符串类型

#字符串可以使用三种引号括起来
# 1.单引号  2.双引号(用法同单引号)
#3.三引号  :三引号中可以换行,前两个不能换行
#三引号可以是三个单引号或者是三个双引号


s=  'hello world'
s2=  "hello world"

s3='''hello
 world'''


print(s3)




