//全勤

//字符处理函数
//数学库的函数

#include  <bits/stdc++.h>
using namespace  std;


//char   arr_c[10];

vector<char>   v_c;


int main(){
	//字符相关函数
	
	
//	char   a,b;
//	cin>>a>>b;
//	cout<<a<<" "<<b;
	//getchar:  输入单个字符
//	char  c=getchar();
	
	
//	char  c=getchar(),  d=getchar();
//	cout<<c<<" "<<d;
	
//	int n;char sp;
//	cin>>n;
//	sp=getchar();
//	for (int i=0;i<n;i++){
//		v_c.push_back(getchar());	
//	}
//	
//	for (auto x: v_c)  cout<<x<<endl;
//	






//putchar  :  输出单个字符

//putchar(97);   //a
//putchar('a');  //a

// 0-670-82162-4

//char   a1,a2,a3,a4,a5,a6,a7,a8,a9,sbm,   x;
//a1=getchar();
//x=getchar();
//a2=getchar();
//a3=getchar();
//a4=getchar();
//x=getchar();
//a5=getchar();
//a6=getchar();
//a7=getchar();
//a8=getchar();
//a9=getchar();
//x=getchar();
//sbm=getchar();
//
//int sum= (a1-48)*1+(a2-48)*2+(a3-48)*3+(a4-48)*4+(a5-48)*5+(a6-48)*6+(a7-48)*7+(a8-48)*8
//+(a9-48)*9;
//int y_sbm=sum%11;  // 'X' 
//
//if (y_sbm==(sbm-48) ||  sbm=='X'  && y_sbm==10    )  cout<<"Right";
//else cout<<"Wrong";




//数学函数
//abs  : 求绝对值

//cout<<abs(-0.9);

//max/min

//swap
//pow

//rand:  返回随机数

 //srand(time(nullptr));//产生随机数种子
 srand(0);

for (int i=0;i<100;i++)
cout<<rand()<< " ";
//41 18467 6334 26500 19169 15724 11478 29358 26962 24464 
//5705 28145 23281 16827 9961 491 2995 11942 4827 5436 32391 
//14604 3902 153 292 12382 17421 18716 19718 19895 5447 21726
// 14771 11538 1869 19912 25667 26299 17035 9894 28703 23811 31322
//  30333 17673 4664 15141 7711 28253 6868 25547 27644 32662 32757 
//  20037 12859 8723 9741 27529 778 12316 3035 22190 1842 288 30106
//   9040 8942 19264 22648 27446 23805 15890 6729 24370 15350 15006 
//   31101 24393 3548 19629 12623 24084 19954 18756 11840 4966 7376 13931 26308 16944 32439 
//
//
//
//
//24626 11323 5537 21538 16118 2082 22929 16541



	return   0;
}










//  ISBN  : 
// 0-670-82162-4
//0: 英语  670: 维京出版社  82162: 这本书在出版社的编号 4:识别码
//识别码的计算方法如下:
//0-670-82162-4 :  
//067082162  =>  (0*1+6*2+7*3+0*4+8*5+2*6+1*7+6*8+2*9)%11 = 4

//任务是写程序判断输入的ISBN码是否正确,正确输出"Right",否则输出
//"Wrong"



//输入格式:
//一行, 是一个ISBN码
//输出格式:
//一行




 


