// 吴文灏  何小睿 李一旗  刘梓钺 焦陈昊

#include <bits/stdc++.h>
using namespace std;
int main(){
	
	//"\n"也表示换行,但是必须有引号包围
//	cout<<"望庐山瀑布\n李白\n";
//cout<<"1234*5678="<<1234*5678;
	//A~G   H~N  O~T   U~Z
	
	//shift键:   中英文输入法转换
	
	
	
	//声明变量
	//这里的等号表示把19赋值给变量a
	//在声明变量的时候一定要赋初始值
	//int  a =11;  
	//int表示变量a是整数类型
	//a是变量的名字
	// a=11 表示把11赋值给变量a
	

	//cout<<a;
	
	
	
	//变量的命名规则
	//1.变量名由字母 数字或下划线组成,不能有其他字符
	//2.变量名不能由数字开头
	
//	
int  a =11;
//	cout<<__;
//	
	
	//声明多个变量
	
	int  a=1,  b=3,  c=5;
	cout<<a<<" "<<b<<" "<<c;
	
	
	
	
	
	return 0;
}









//什么是变量?
//变量就是装数据的容器

//跟scratch不一样,  C++中的数据是分类的,
//称之为数据类型
//常见的数据类型有:  string(字符串)  数字






