//全勤

#include <bits/stdc++.h>
using namespace std;
int main(){
	// ()  用于提高优先级
	//  提高优先级只能使用圆括号, 跟数学中不一样
//	int   a=(1+5-(2+3))*(6/5); 
	// 分号:  用于分隔语句
	//逗号:  分割表达式
//	int    b=3,  c=6;//C++中声明的变量名字不能相同


//int  x,y;
//cin>>x>>y;
//
//cout<<2*x-y/2<<" "<<(y-2*x)/2;
//

//int   a1,a2,n;
//cin>>a1>>a2>>n;
//int p=a2-a1;
//cout<<a1+(n-1)*p;



// 整数类型
// short (16位)    -32768~ 32767
//  int  (32位)     -2147483648~2147483647
//long  long (64位)   -9223372036854775808~9223372036854775807



//无符号整型 (表示非负整数)
//unsigned short  (16位)  0~65535
//unsigned  (32位)       0~4292967295
//unsigned long  long (64位)  0~18446744073709551615


//浮点数
//float  (32位)
//double  (64位)
//long  double (96位)  

	//  位数相同的浮点数比整数要大很多
	
	
	
	
	//整数溢出
//	int   a=2147483647+2147483649;
//	cout<<a+1;
	
	
	//混合运算时的类型转换
	
	// int  , long long  ,double 
	//为了保证运算精度,  系统在运算时的类型转换规则是将存储长度较短的
	//类型转换为存储长度较长的类型
	
	
	//sizeof(): 参数可以是类型名   变量名  或者是  值
	// 返回值是字节数
	//1字节 =  8位
	int aa=11;
	cout<<sizeof(int)<<endl;
	cout<<sizeof(long long)<<endl;
	cout<<sizeof(long double)<<endl;
		cout<<sizeof(aa)<<endl;
	return 0;
}



//鸡兔同笼
//已知头共x个, 脚共y个,  问笼中鸡和兔各有多少只
//输入
// x  y
//输出
//鸡和兔的数量




//给出一个等差数列的前两项a1  a2,求第n项是多少





//输入a  b   c分别表示 长方体的长 宽 高,  求长方体的表面积




//(a*b+b*c+a*c)*2



  //对于阻值为r1  r2的电阻,  其并联电阻的阻值计算公式:
  //R=1/(1/r1+1/r2)
  
  //输入r1和r2,输出并联电阻的阻值,保留两位小数
  
  //1 1
  //0.50












