#  liankexue.cn
#2025-03 python二级
#1 8 11 16 17 30   33 34  

#格式化生成字符串
# ~ name='小明'
# ~ age=12
# ~ h=1.76
# ~ s='我叫%s,今年%d岁,身高%.2f米'%(name,age , h)
# ~ s2='我叫{1},今年{0}岁,身高{0}米'.format(name,age,h)
# ~ s3='我叫{0:s},今年{1:d}岁,身高{2:.3f}米'.format(name,age,h)
# ~ s4='我叫{},今年{:d}岁,身高{}米'.format(name,age,h)
# ~ print(s4)



#2024-12 python二级
#11   13    17 21  30   31   34   




# ~ s={'数学':100,'语文':95,'英语':98,'科学':97,'美术':98,'音乐':99}
# ~ s.remove('音乐')

#为什么字典中没有remove函数?
# 因为remove是按照值删除元素, 字典中有可能会出现多个值相同的元素



#列表和元组没有get方法
# ~ t=[90,98,89]
# ~ d={1:4}
# ~ print(d.get(1))


#Python中可以修改的数据类型有列表和字典,  其他的都不能修改


s='hello'*3
s=s+'eh'
print(s)








#2024-9 python二级
#1 3 4 6 8 9 11 12    17     21        29 30   32   



#2024-12 第21题讲完,  2024-09没讲



