#include <bits/stdc++.h>
using namespace std;
int main(){
	
	
//	printf("%03d%d",  1,2);	
//	cout<<endl;
//	printf("%05.1f",  1.2);





//	int   n;
//	cin>>n;
//	int h=n/3600,  m= n%3600/60, 
//	 s=n%60;
//	
//	//01:01:41
//	printf("%02d:%02d:%02d",h,m,s  );
	


//格式化输入:  scanf
//之前学的输入函数是cin

// "开始时间是:  02:45:20"

//int   h,m,s;
//scanf("开始时间是:  %d:%d:%d", &h,&m,&s  );
//cout<<h<< " "<<m<<" "<<s;
//



//12:34:56
//12:35:00
//int   h1,h2,m1,m2,s1,s2;
////cin>>h1>>m1>>s1>>h2>>m2>>s2;
//scanf("%d:%d:%d",&h1,&m1,&s1);
//scanf("%d:%d:%d",&h2,&m2,&s2);
//
//int ds=   (h2*3600+m2*60+s2) -  (h1*3600+m1*60 +s1); 
//cout<<ds;
//	return 0;
//}













//   %05.2f   :  5是显示位宽,  0表示空位填充0
//2表示保留两位小数,f表示浮点数类型

//%05d    : 5是显示位宽, 0表示空位填充0, d表示整数类型







// 电子表上的时间显示方法形如 xx:xx:xx,
//现在给出一个时间,单位是秒,
//要求按照电子表格式输出


//输入:
//3701

//输出:
//01:01:41













//给出两个时刻,问第一个时刻到第二个时刻要
//经过多少秒

//输入:
//12:34:56
//12:35:00
//输出:
//4







