#include  <bits/stdc++.h>
using namespace std;
int main(){
	//整数类型
	//变量在声明的时候一定要对其初始化
//	int   n=88+4;//这里的等号表示赋值
	//赋值语句的执行顺序是从右到左
	
	//声明多个变量
	
//	int    a=1,b=2,  c;
//	c=a;
//	a=b;
//	b=c;
//	
//	cout<<a<<" "<<b;
	
	
	
	
	//输入
	//从输入设备将数据输送进C++程序
	//输入设备一般指的是键盘
//	int  a  ,   b;
//	cin>>a>>b;
//	cout<<a+b;
//	
//	int  h;
//	cout<<"请输入你的身高:";
//	cin>>h;
//	cout<<"俺的身高是"<<h<<"cm";
//	
//	
//	
	
	
	
	//变量的命名规则:
	//1.变量名由字母 数字 或下划线组成
	//2.变量名不能以数字开头
	
	
//	int  _n2=111;
//	cout<<_n2;
//	
	
	
	//输入三个整数,输出它们的和
	
	
	
	
	
	
//	int   a,b,c;
//	cin>>a>>b>>c;
//	cout<<a+b+c;
//	
	
	int   m,n;//    m是跳绳的数量,n是每班分多少根
	
	cin>>m>>n;
	
	cout<<m/n<<" "<<m%n;
	
	//   m/n:  如果m和n都是整数,那么m/n的结果也是整数
	
	
	
	
	
	return 0;
}



// 变量是什么?
//变量就是一个能存数据的容器


//   数据类型
//类型就是分类
//数据类型本质就是给数据分类
//为什么要给数据分类?
//为了方便处理数据,因为不同的数据的处理方式是不一样的



//  oj.czos.cn



