//  陶源  董辰韬

#include <bits/stdc++.h>
using namespace std;
int main(){
//	int _9a = 10;//这里的等号读作 赋值
//	_9a =99;
//	cout<<  _9a;
//	


//	int  a=10,b=20;
//
//	int tmp=b;
//	b=a;// 赋值语句的执行顺序是从右向左
//	a=tmp;
//	cout<<"a:"<<a<<" b:"<<b;

//	int  a=10,b=20,c=30;
//	// a:30 b:10  c: 20
//	int tmp=a;
//	a=c;
//	c=b;
//	b=tmp;
//	cout<<"a:"<<a<<" b:"<<b<<" c:"<<c;


	cout<<880*500;

	return 0;
}



///什么是变量?
//变量是用来存储数据的容器






//cout<<"望庐山瀑布\n";// 或者endl
	
	//声明变量
	//int 整数类型
	//  88   "望庐山瀑布\n"
	
	//什么是数据类型?
	//根据数据的不同性质给数据的分类
	//叫做数据类型
	
	//数据类型有哪些?
	//数字 字符串
	//数字分为:  整数(int) 小数(float)
	
	//变量的命名规则?
	//1.变量名必须由 字母 数字 或 下划线组成
	//2.变量名不能以数字开头

//长880  宽500  求面积





